<template>
  <van-notice-bar wrapable :scrollable="false" left-icon="volume-o" :text="words"/>
  <nav-bar></nav-bar>
</template>
<script>
export default {
  name: 'App',
}
</script>
<script setup>
  //引入导航栏
  import NavBar from './components/NavBar.vue'
  import {ref ,onMounted} from 'vue'
  const words = ref([]);
  const str = ref('新华社北京12月5日电　题：步履坚定，共绘高质量发展新篇章——各地贯彻党的十九届六中全会精神纪实\n' +
          '\n' +
          '新华社记者\n' +
          '\n' +
          '发展，是解决一切问题的总钥匙。\n' +
          '\n' +
          '党的十九届六中全会审议通过《中共中央关于党的百年奋斗重大成就和历史经验的决议》强调，必须实现创新成为第一动力、协调成为内生特点、绿色成为普遍形态、开放成为必由之路、共享成为根本目的的高质量发展。\n' +
          '\n' +
          '近日新华社记者奔赴多地，到企业车间、基层一线、群众当中，亲历贯彻全会精神的火热气象，感受落实新发展理念蔚然成风。\n' +
          '\n' +
          '提质增效，跃上发展新台阶\n' +
          '\n' +
          '走进济钢集团，黑色钢铁已不见踪影。36岁的技术人员陈书超身着白大褂，正操作数控机床加工直径几微米的精密零部件。\n' +
          '\n' +
          '对于转型发展，他有着切身收获：“企业从‘靠钢吃饭’到‘无钢发展’，我的工作也从铸造‘大黑粗’变成加工‘高精尖’，环境好了，收入也高了。”\n' +
          '\n' +
          '2017年，有着60年历史的济钢关停全部钢铁生产线。如今，济钢度过转型阵痛，向新材料、高端装备制造转型。2021年，集团产值预计和退出钢铁产能前相当，但能耗、大气污染物排放均只有以前的“零头”。\n' +
          '\n' +
          '“要努力提升技能，适应企业转型的新需要，以实际行动响应全会关于推动高质量发展的号召。”陈书超说。\n' +
          '\n' +
          '12月的浙江安吉，依旧满目青翠。“保护生态环境就是保护生产力，改善生态环境就是发展生产力，我们深有体会。”浙江省湖州市委常委、安吉县委书记杨卫东说。\n' +
          '\n' +
          '“绿水青山就是金山银山。”刚刚从山川乡大里村调研回来的他，掰着手指给记者盘算，“那里旅游资源丰富、客流充足，要把闲置办公楼等资源都盘活用好，同时想办法带动村民参与乡村旅游经营，壮大集体经济、为村民增收。”\n' +
          '\n' +
          '从北到南、由西至东，各地干部群众高度认同全会总结的宝贵经验，将贯彻新发展理念作为自觉行动。\n' +
          '\n' +
          '冬日南国，天蓝海碧。记者登上海南洋浦经济开发区国投洋浦港码头，近5万吨进口菜籽原料经检疫合格后，被装上一辆辆卡车，运往洋浦保税港区的澳斯卡粮油加工厂。\n' +
          '\n' +
          '“我们既是开放战略的践行者，更是受益者，从自贸港加工增值政策获得巨大商机。”海南澳斯卡国际粮油有限公司总经理张慧介绍，自今年7月投产以来，公司已完成加工增值业务95票，免征关税约1758万元。\n' +
          '\n' +
          '“全会提出全面深化改革开放，我们将依托国内超大规模市场优势，抢抓市场机遇，以高水平开放推动高质量发展。”张慧说。\n' +
          '\n' +
          '改革创新，汇聚发展新动力\n' +
          '\n' +
          '像一个金色大吊灯，又像一个多层的旋转木马……在中国科学技术大学物理学院的实验室里，特任教授曹刚正在为提升量子计算机的算力忙碌。\n' +
          '\n' +
          '他所在的科研团队刚刚在半导体量子芯片研究上获得重要进展。\n' +
          '\n' +
          '“全会要求推进科技自立自强，作为科技工作者倍感使命光荣、责任重大。”曹刚说，量子科技是关键核心技术领域。目前团队正在积极筹划新的科研计划，力争在新阶段实现从追赶到并跑、赶超的跨越。\n' +
          '\n' +
          '冰天雪地的东北，沈阳鼓风机集团透平公司的智能化车间里，一台台数字化工位机有条不紊地工作，各种生产信息在显示屏上一目了然。\n' +
          '\n' +
          '“全会提出坚持开拓创新，对我们这样的老字号国企来说，就是要赶上时代发展的浪潮，抓住新一代信息技术和产业变革的机遇，坚持在改革中实现转型发展。”沈鼓集团董事长戴继双说。\n' +
          '\n' +
          '采访越深入，记者越真切地感受到，全会精神正激发大家拿出更大魄力、更加主动改革创新，推动各行各业加速转入高质量发展轨道。\n' +
          '\n' +
          '揉面、拌馅、印花、烤制……在新疆伊犁的霍尔果斯馕产业园里，刚出炉的馕散发着诱人的香味。“最近又有来自俄罗斯和白俄罗斯的线上订单，得抓紧赶制240万个馕。”霍尔果斯金亿国际贸易（集团）有限公司董事长于成忠仔细查看生产进度。\n' +
          '\n' +
          '霍尔果斯创新发展模式，通过引入金亿这样的外贸企业参与产品研发、改良种类，加快了馕产业走出国门的步伐。\n' +
          '\n' +
          '“‘敢为天下先，走出了前人没有走出的路’。全会总结历史经验里的这句话，将激励我们全方位拓展产业链，用小馕饼撬动大产业。”于成忠信心十足。\n' +
          '\n' +
          '奋发有为，共绘发展新篇章\n' +
          '\n' +
          '推动高质量发展是一场关系经济社会全局的深刻变革，必须持之以恒加以推进。唯有锐意进取、奋发有为，才能实现这一伟大历史目标。\n' +
          '\n' +
          '冬日的寒风里，胜利油田百万吨CCUS（碳捕获、利用与封存）示范工程13号站，正在进行最后的建设冲刺。工程将于年底投产，建成后每年可利用二氧化碳100万吨。\n' +
          '\n' +
          '将二氧化碳用于石油开采，是胜利油田在“碳中和”领域的最新技术应用，可带来经济效益和生态效益双赢。\n' +
          '\n' +
          '“全会提出，坚持人与自然和谐共生，这让我对二氧化碳驱油技术的推广应用有了更坚定的信心。”中国石化胜利油田注汽技术服务中心二氧化碳项目部经理屈龙涛表示。\n' +
          '\n' +
          '“未来之城”雄安，已进入承接北京非首都功能疏解和大规模开发建设同步推进的关键阶段。\n' +
          '\n' +
          '“十九届六中全会的胜利召开，是激励，更是召唤，让我们凝心聚力、倍增干劲。”雄安新区改革发展局局长于国义说，下一步将有序推进启动区和容东片区建设，把高质量发展贯穿于规划建设的全过程，打造样板工程。\n' +
          '\n' +
          '高质量发展是以人民为中心的发展。\n' +
          '\n' +
          '福建晋江，正在探路共同富裕县域示范。经历40多年发展，晋江目前培育壮大市场主体24万个，数以百万计的务工人员稳定就业。\n' +
          '\n' +
          '重整行装再出发，锚定目标再超越。\n' +
          '\n' +
          '“党的十九届六中全会通过的决议指出，坚定不移走全体人民共同富裕道路，为我们指明了方向。”泉州市委常委、晋江市委书记张文贤说，要始终把高质量发展的文章做好，激发市场主体活力，增强创业就业能力，均等化公共服务，让更多群众享受发展成果。（记者：姜琳、陈灏、闫起磊、关俏俏、徐海涛、邹明仲、岳德亮、吴茂辉、吴剑锋)');
  const letters = ref([]);
  // const order = ref(1);
  //开始输入的效果动画
  const  begin=()=>{
    letters.value=str.value.split("")
    console.log(letters.value)
    for(var i=0;i<letters.value.length;i++){
      setTimeout(write(i),i*200);
    }
  }
  //输入字母
  const write=(i)=>{
    return ()=>{
      let L=letters.value.length;
      words.value.push(letters.value[i]);
      /*如果输入完毕，在2s后开始删除*/
      if(i==L-1){
        setTimeout(function(){
          // back();
        },2000);
      }
    }
  }
  //开始删除的效果动画
  // const back=()=>{
  //   let L=letters.value.length;
  //   for(var i=0;i<L;i++){
  //     setTimeout(wipe(i),i*50);
  //   }
  // }
  //擦掉(删除)字母
  // const wipe=(i)=>{
  //   return ()=>{
  //     words.value.pop(letters.value[i]);
  //     /*如果删除完毕，在300ms后开始输入*/
  //     if(words.value.length==0){
  //       order.value++;
  //       setTimeout(function(){
  //         begin();
  //       },300);
  //
  //     }
  //   }
  // }
  onMounted(()=>{
    begin();
  })

</script>
<style>
</style>
